In [42]:
import pandas as pd
import numpy as np

In [43]:
df = pd.DataFrame([])

In [44]:
df.dropna?

In [46]:
df = pd.DataFrame({"number" : [np.nan, 15,19, 12],
                   "name": ['Alfred', 'Batman', 'Catwoman', np.nan],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip', np.nan],
                   "born": [np.nan, "1940-04-25", np.nan, np.nan]})
df

   number      name        toy        born
0     NaN    Alfred        NaN         NaN
1    15.0    Batman  Batmobile  1940-04-25
2    19.0  Catwoman   Bullwhip         NaN
3    12.0       NaN        NaN         NaN

In [47]:
df.dropna(axis=1, how='any')      # drop the column if any null

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [48]:
df.dropna(axis=0, how='any')      # drop any row if any null

   number    name        toy        born
1    15.0  Batman  Batmobile  1940-04-25

In [49]:
df.dropna(axis=0, how='all')     # drop the row if all data is null

   number      name        toy        born
0     NaN    Alfred        NaN         NaN
1    15.0    Batman  Batmobile  1940-04-25
2    19.0  Catwoman   Bullwhip         NaN
3    12.0       NaN        NaN         NaN

In [50]:
df.fillna(0)

   number      name        toy        born
0     0.0    Alfred          0           0
1    15.0    Batman  Batmobile  1940-04-25
2    19.0  Catwoman   Bullwhip           0
3    12.0         0          0           0

In [51]:
values = {'name':'Anonymous', 'toy':'Unknown', 'born':'0000-00-00'}
df.fillna(values)

   number       name        toy        born
0     NaN     Alfred    Unknown  0000-00-00
1    15.0     Batman  Batmobile  1940-04-25
2    19.0   Catwoman   Bullwhip  0000-00-00
3    12.0  Anonymous    Unknown  0000-00-00

In [54]:
df['number'].fillna(df['number'].mean())

0    15.333333
1    15.000000
2    19.000000
3    12.000000
Name: number, dtype: float64

In [56]:
df.isnull().sum()      # how many null in each column

number    1
name      1
toy       2
born      3
dtype: int64

In [57]:
df.notnull().sum()

number    3
name      3
toy       2
born      1
dtype: int64